examples/homuPorousInterFoam/pressureDrop1D/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    leftWall
    {
        type            patch;
        nFaces          1;
        startFace       79;
    }
    rightWall
    {
        type            patch;
        nFaces          1;
        startFace       80;
    }
    defaultFaces
    {
        type            empty;
        inGroups        1(empty);
        nFaces          320;
        startFace       81;
    }
)

// ************************************************************************* //
