examples/homuPorousInterFoam/pressureDrop1D/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue alpha.water 1
    volScalarFieldValue varepsilon 1
    //volScalarFieldValue varepsilon 0.496
);

regions
(
    /*
    boxToCell
    {
        // water dam
        box (0 0 -1) (0.4 0.8 1);
        fieldValues
        (
            volScalarFieldValue alpha.water 1
        );
    }
    */
    
    boxToCell
    {
        // porous region in [0.15<x<0.65]
        box (0.15 -1 -1) (0.65 1 1);
        fieldValues
        (
            volScalarFieldValue varepsilon 0.496
        );
    }
);


// ************************************************************************* //
